; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=8, locations=11, density=0.8, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=50, seed=91

(define (problem transport-50)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l8)
    (at p3 l8)
    (at p4 l8)
    (at p5 l5)
    (at p6 l4)
    (at p7 l4)
    (at p8 l10)
    (at v1 l6)
    (at v2 l8)
    (at v3 l4)
    (at v4 l4)
    (road l4 l6)
    (road l9 l5)
    (road l5 l10)
    (road l9 l11)
    (road l1 l9)
    (road l7 l4)
    (road l5 l9)
    (road l9 l1)
    (road l8 l5)
    (road l10 l2)
    (road l10 l5)
    (road l2 l10)
    (road l6 l4)
    (road l4 l1)
    (road l4 l7)
    (road l3 l11)
    (road l5 l8)
    (road l11 l3)
    (road l11 l9)
    (road l1 l4)
    (road l8 l10)
    (road l10 l8)
    (road l2 l11)
    (road l11 l2)
    (road l5 l11)
    (road l11 l5)
    (road l3 l8)
    (road l8 l3)
    (road l2 l8)
    (road l8 l2)
    (road l1 l11)
    (road l11 l1)
    (road l1 l3)
    (road l3 l1)
    (road l8 l9)
    (road l9 l8)
    (road l2 l3)
    (road l3 l2)
    (road l9 l10)
    (road l10 l9)
    (road l3 l5)
    (road l5 l3)
    (road l2 l4)
    (road l4 l2)
    (road l1 l2)
    (road l2 l1)
    (road l1 l8)
    (road l8 l1)
    (road l7 l8)
    (road l8 l7)
    (road l5 l6)
    (road l6 l5)
    (road l8 l11)
    (road l11 l8)
    (road l1 l10)
    (road l10 l1)
    (road l4 l5)
    (road l5 l4)
    (road l3 l10)
    (road l10 l3)
    (road l2 l5)
    (road l5 l2)
    (road l3 l9)
    (road l9 l3)
    (road l2 l9)
    (road l9 l2)
    (road l6 l7)
    (road l7 l6)
    (road l3 l7)
    (road l7 l3)
    (road l6 l11)
    (road l11 l6)
    (road l4 l8)
    (road l8 l4)
    (road l7 l10)
    (road l10 l7)
    (road l5 l7)
    (road l7 l5)
    (road l6 l8)
    (road l8 l6)
    (road l10 l11)
    (road l11 l10)
    (road l3 l6)
    (road l6 l3)
    (road l4 l10)
    (road l10 l4)
    (road l7 l11)
    (road l11 l7)
    )
 (:goal  (and 
    (at p1 l7)
    (at p2 l1)
    (at p3 l1)
    (at p4 l6)
    (at p5 l9)
    (at p6 l3)
    (at p7 l1)
    (at p8 l7))))

; plan
1. (pick-up v4 l4 p6 c1 c2)
   deleted: (at p6 l4) (capacity v4 c2)
   added: (in p6 v4) (capacity v4 c1)
   goals met: 0 of 8
2. (drive v1 l6 l5)
   deleted: (at v1 l6)
   added: (at v1 l5)
   goals met: 0 of 8
3. (pick-up v1 l5 p5 c0 c1)
   deleted: (at p5 l5) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 0 of 8
4. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 0 of 8
5. (drop v1 l9 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l9) (capacity v1 c1)
   goals met: 1 of 8
6. (pick-up v4 l4 p7 c0 c1)
   deleted: (at p7 l4) (capacity v4 c1)
   added: (in p7 v4) (capacity v4 c0)
   goals met: 1 of 8
7. (drive v4 l4 l1)
   deleted: (at v4 l4)
   added: (at v4 l1)
   goals met: 1 of 8
8. (drop v4 l1 p7 c0 c1)
   deleted: (in p7 v4) (capacity v4 c0)
   added: (at p7 l1) (capacity v4 c1)
   goals met: 2 of 8
9. (drive v4 l1 l3)
   deleted: (at v4 l1)
   added: (at v4 l3)
   goals met: 2 of 8
10. (drop v4 l3 p6 c1 c2)
   deleted: (in p6 v4) (capacity v4 c1)
   added: (at p6 l3) (capacity v4 c2)
   goals met: 3 of 8
11. (pick-up v2 l8 p4 c0 c1)
   deleted: (at p4 l8) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 3 of 8
12. (drive v2 l8 l6)
   deleted: (at v2 l8)
   added: (at v2 l6)
   goals met: 3 of 8
13. (drop v2 l6 p4 c0 c1)
   deleted: (in p4 v2) (capacity v2 c0)
   added: (at p4 l6) (capacity v2 c1)
   goals met: 4 of 8
14. (drive v4 l3 l8)
   deleted: (at v4 l3)
   added: (at v4 l8)
   goals met: 4 of 8
15. (pick-up v4 l8 p3 c1 c2)
   deleted: (at p3 l8) (capacity v4 c2)
   added: (in p3 v4) (capacity v4 c1)
   goals met: 4 of 8
16. (pick-up v4 l8 p2 c0 c1)
   deleted: (at p2 l8) (capacity v4 c1)
   added: (in p2 v4) (capacity v4 c0)
   goals met: 4 of 8
17. (drive v4 l8 l1)
   deleted: (at v4 l8)
   added: (at v4 l1)
   goals met: 4 of 8
18. (drop v4 l1 p2 c0 c1)
   deleted: (in p2 v4) (capacity v4 c0)
   added: (at p2 l1) (capacity v4 c1)
   goals met: 5 of 8
19. (drop v4 l1 p3 c1 c2)
   deleted: (in p3 v4) (capacity v4 c1)
   added: (at p3 l1) (capacity v4 c2)
   goals met: 6 of 8
20. (drive v4 l1 l10)
   deleted: (at v4 l1)
   added: (at v4 l10)
   goals met: 6 of 8
21. (pick-up v4 l10 p8 c1 c2)
   deleted: (at p8 l10) (capacity v4 c2)
   added: (in p8 v4) (capacity v4 c1)
   goals met: 6 of 8
22. (drive v4 l10 l8)
   deleted: (at v4 l10)
   added: (at v4 l8)
   goals met: 6 of 8
23. (pick-up v4 l8 p1 c0 c1)
   deleted: (at p1 l8) (capacity v4 c1)
   added: (in p1 v4) (capacity v4 c0)
   goals met: 6 of 8
24. (drive v4 l8 l7)
   deleted: (at v4 l8)
   added: (at v4 l7)
   goals met: 6 of 8
25. (drop v4 l7 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l7) (capacity v4 c1)
   goals met: 7 of 8
26. (drop v4 l7 p8 c1 c2)
   deleted: (in p8 v4) (capacity v4 c1)
   added: (at p8 l7) (capacity v4 c2)
   goals met: 8 of 8
